const Assets = {
  data: {
    epicenter: {
      // epicenter list of JMA
      jma: ["石狩地方北部","石狩地方中部","石狩地方南部","後志地方北部","後志地方東部","後志地方西部","空知地方北部","空知地方中部","空知地方南部","渡島地方北部","渡島地方東部","渡島地方西部","檜山地方","北海道奥尻島","胆振地方西部","胆振地方中東部","日高地方西部","日高地方中部","日高地方東部","上川地方北部","上川地方中部","上川地方南部","留萌地方中北部","留萌地方南部","宗谷地方北部","宗谷地方南部","北海道利尻礼文","網走地方","北見地方","紋別地方","十勝地方北部","十勝地方中部","十勝地方南部","釧路地方北部","釧路地方中南部","根室地方北部","根室地方中部","根室地方南部","青森県津軽北部","青森県津軽南部","青森県三八上北","青森県下北","岩手県沿岸北部","岩手県沿岸南部","岩手県内陸北部","岩手県内陸南部","宮城県北部","宮城県中部","宮城県南部","秋田県沿岸北部","秋田県沿岸南部","秋田県内陸北部","秋田県内陸南部","山形県庄内","山形県最上","山形県村山","山形県置賜","福島県中通り","福島県浜通り","福島県会津","茨城県北部","茨城県南部","栃木県北部","栃木県南部","群馬県北部","群馬県南部","埼玉県北部","埼玉県南部","埼玉県秩父","千葉県北東部","千葉県北西部","千葉県南部","東京都２３区","東京都多摩東部","東京都多摩西部","伊豆大島","新島","神津島","三宅島","八丈島","小笠原","神奈川県東部","神奈川県西部","新潟県上越","新潟県中越","新潟県下越","新潟県佐渡","富山県東部","富山県西部","石川県能登","石川県加賀","福井県嶺北","福井県嶺南","山梨県東部・富士五湖","山梨県中・西部","長野県北部","長野県中部","長野県南部","岐阜県飛騨","岐阜県美濃東部","岐阜県美濃中西部","伊豆地方","静岡県東部","静岡県中部","静岡県西部","愛知県東部","愛知県西部","三重県北部","三重県中部","三重県南部","滋賀県北部","滋賀県南部","京都府北部","京都府南部","大阪府北部","大阪府南部","兵庫県北部","兵庫県南東部","兵庫県南西部","兵庫県淡路島","奈良県","和歌山県北部","和歌山県南部","鳥取県東部","鳥取県中部","鳥取県西部","島根県東部","島根県西部","島根県隠岐","岡山県北部","岡山県南部","広島県北部","広島県南東部","広島県南西部","山口県北部","山口県東部","山口県中部","山口県西部","徳島県北部","徳島県南部","香川県東部","香川県西部","愛媛県東予","愛媛県中予","愛媛県南予","高知県東部","高知県中部","高知県西部","福岡県福岡","福岡県北九州","福岡県筑豊","福岡県筑後","佐賀県北部","佐賀県南部","長崎県北部","長崎県南西部","長崎県島原半島","長崎県対馬","長崎県壱岐","長崎県五島","熊本県阿蘇","熊本県熊本","熊本県球磨","熊本県天草・芦北","大分県北部","大分県中部","大分県南部","大分県西部","宮崎県北部平野部","宮崎県北部山沿い","宮崎県南部平野部","宮崎県南部山沿い","鹿児島県薩摩","鹿児島県大隅","鹿児島県十島村","鹿児島県甑島","鹿児島県種子島","鹿児島県屋久島","鹿児島県奄美北部","鹿児島県奄美南部","沖縄県本島北部","沖縄県本島中南部","縄県久米島","沖縄県大東島","沖縄県宮古島","沖縄県石垣島","沖縄県与那国島","沖縄県西表島"],
      // epicenter list of NHK
      nhk: ["石狩北部","石狩中部","石狩南部","後志北部","後志東部","後志西部","空知北部","空知中部","空知南部","渡島北部","渡島東部","渡島西部","檜山地方","北海道奥尻島","胆振西部","胆振中東部","日高西部","日高中部","日高東部","上川地方北部","上川地方中部","上川地方南部","留萌中北部","留萌南部","宗谷北部","宗谷南部","北海道利尻礼文","網走地方","北見地方","紋別地方","十勝北部","十勝中部","十勝南部","釧路北部","釧路中南部","根室北部","根室中部","根室南部","津軽北部","津軽南部","青森三八上北","青森下北","岩手沿岸北部","岩手沿岸南部","岩手内陸北部","岩手内陸南部","宮城北部","宮城中部","宮城南部","秋田沿岸北部","秋田沿岸南部","秋田内陸北部","秋田内陸南部","山形庄内地方","山形最上地方","山形村山地方","山形置賜地方","福島中通り","福島浜通り","会津","茨城北部","茨城南部","栃木北部","栃木南部","群馬北部","群馬南部","埼玉北部","埼玉南部","秩父地方","千葉北東部","千葉北西部","千葉南部","東京２３区","東京多摩東部","東京多摩西部","伊豆大島","新島地方","神津島","三宅島","八丈島","小笠原","神奈川東部","神奈川西部","新潟上越地方","新潟中越地方","新潟下越地方","佐渡地方","富山東部","富山西部","能登地方","加賀地方","福井嶺北地方","福井嶺南地方","山梨東部・富士五湖","山梨中・西部","長野北部","長野中部","長野南部","飛騨地方","美濃東部","美濃中西部","伊豆地方","静岡東部","静岡中部","静岡西部","愛知東部","愛知西部","三重北部","三重中部","三重南部","滋賀北部","滋賀南部","京都北部","京都南部","大阪北部","大阪南部","兵庫北部","兵庫南東部","兵庫南西部","淡路島","奈良県","和歌山北部","和歌山南部","鳥取東部","鳥取中部","鳥取西部","島根東部","島根西部","隠岐","岡山北部","岡山南部","広島北部","広島南東部","広島南西部","山口北部","山口東部","山口中部","山口西部","徳島北部","徳島南部","香川東部","香川西部","愛媛東予地方","愛媛中予地方","愛媛南予地方","高知東部","高知中部","高知西部","福岡地方","北九州地方","筑豊地方","筑後地方","佐賀北部","佐賀南部","長崎北部","長崎南西部","島原半島","対馬地方","壱岐地方","五島地方","阿蘇地方","熊本地方","球磨地方","天草・芦北","大分北部","大分中部","大分南部","大分西部","宮崎北部平野部","宮崎北部山沿い","宮崎南部平野部","宮崎南部山沿い","薩摩地方","大隅地方","十島村","甑島","種子島地方","屋久島地方","奄美北部","奄美南部","沖縄本島北部","沖縄本島中南部","久米島地方","大東島地方","宮古島地方","石垣島地方","与那国島地方","西表島地方"],
      // epicenter code list
      code: [100,101,102,105,106,107,110,115,116,117,120,121,122,125,126,127,130,131,135,136,140,141,142,145,146,150,151,152,155,156,157,160,161,165,166,167,180,181,182,183,184,186,187,188,189,190,191,192,193,194,195,196,197,200,201,202,203,210,211,212,213,220,221,222,230,231,232,233,240,241,242,243,250,251,252,280,281,282,283,284,285,286,287,288,289,300,301,309,310,311,320,321,330,331,332,340,341,342,349,350,351,352,360,361,370,371,372,378,379,380,381,390,391,400,401,411,412,420,421,422,430,431,432,440,441,442,443,450,451,460,461,462,469,471,472,473,475,476,477,478,480,481,482,483,485,486,487,489,490,492,493,494,495,497,498,499,500,501,510,511,520,521,530,531,532,540,550,551,560,562,563,570,571,580,581,590,591,592,600,601,610,611,620,621,622,630,631,632,673,674,675,676,677,678,679,680,681,682,683,684,685,686,687,688,689,700,702,703,704,710,711,712,713,720,721,730,731,732,740,741,742,743,750,751,752,753,760,761,762,763,770,771,783,784,785,786,787,790,791,793,795,796,797,798,799,820,821,822,823,850,851,852,853,854,855,856,857,858,859,860,900,901,902,903,904,905,906,907,908,909,911,912,913,914,915,916,917,918,919,920,921,922,930,932,933,934,935,936,937,938,939,940,941,942,943,944,945,946,947,948,949,950,951,952,953,954,955,956,957,958,959,960,961,962,963,964,965,966,967,968,969,970,971,972,973,974,975,976,977,978,979,999]
    },
    intensity: {
      view: ["","1","2","3","4","5弱以上","5弱","5強","6弱","6強","7"],
      nhk: ["","1","2","3","4","?","5-","5+","6-","6+","7"]
    }
  },
  // Mscale(Weathernews) color
  colorScheme: [
    [
      ["#5a94f2","#d1d900","#ff3d3d"],
      [   null  ,   null  ,   null  ], // background colors
      ["#71f043","#c852ff","#ffffff"],
      ["#fcfefa","#7e3287","#f0ff4a"], // main text colors
      ["#777","#ddd4bf"], // waiting text colors being changed by Mscale (M2 or not)
      ["#fff","#333","#d6231d",["#fff","#333","#fff"],"#1144ed"],
      ["#370921","#fff","#fd942a","#393939"] // clock colors
    ], // light mode
    [
      ["#302ad1","#d1c12c","#a81b1b"],
      [   null  ,   null  ,   null  ], // done
      ["#71f043","#c852ff","#fff"],
      ["#fff","#fff","#fff"], // done
      ["#666","#bbb"], // done
      ["#333","#fff","#e6e85d",["#fff","#333","#fff"],"#1144ed"], // done
      ["#000","#fff","#ff503c","#000"] // done
    ], // dark mode
    [
      ["#555555","#555555","#555555"],
      ["#444",null,null],
      [null,null,null],
      ["#fff","#fff","#fff"],
      ["#ddd","#ddd"],
      ["#333","#fff","#ffb",["#fff","#fff","#fff"],"#555"], // done
      ["#333","#ddd","#fff","#333"]
    ]  // mono style
  ],
  // intensity list
  p2p_intensity: {
    "-1": undefined,
    "10": "1",
    "20": "2",
    "30": "3",
    "40": "4",
    "45": "5弱",
    "46": "不明",
    "50": "5強",
    "55": "6弱",
    "60": "6強",
    "65": "7"
  }
};

const ConstantData = Assets.data;
const ColorScheme = Assets.colorScheme;
const P2P_intensityList = Assets.p2p_intensity;

{
  let context = window.canvasData.context[1].ctx;
  let gradient = context.createLinearGradient(0, 0, 1080, 0);
  gradient.addColorStop(0, "#105396");
  gradient.addColorStop(1, "#428edd"); // gradient.addColorStop(1, "#377fcd");
  ColorScheme[0][1][0] = gradient;
  gradient = context.createLinearGradient(0, 0, 1080, 0);
  gradient.addColorStop(0, "#ffef35");
  gradient.addColorStop(1, "#fedb85");
  ColorScheme[0][1][1] = gradient;
  gradient = context.createLinearGradient(0, 0, 1080, 0);
  gradient.addColorStop(0, "#b21418");
  gradient.addColorStop(1, "#df261d");
  ColorScheme[0][1][2] = gradient;
  gradient = context.createLinearGradient(0, 0, 0, 60);
  gradient.addColorStop(0, "#3a37bd");
  gradient.addColorStop(1, "#151299");
  ColorScheme[1][1][0] = gradient;
  gradient = context.createLinearGradient(0, 0, 0, 60);
  gradient.addColorStop(0, "#b3a425");
  gradient.addColorStop(1, "#c7b830");
  ColorScheme[1][1][1] = gradient;
  gradient = context.createLinearGradient(0, 0, 0, 60);
  gradient.addColorStop(0, "#d91c18");
  gradient.addColorStop(1, "#b01815");
  ColorScheme[1][1][2] = gradient;
  gradient = context.createLinearGradient(0, 20, 0, 60);
  gradient.addColorStop(0.75, "#444");
  gradient.addColorStop(1.00, "#882");
  ColorScheme[2][1][1] = gradient;
  gradient = context.createLinearGradient(0, 20, 0, 60);
  gradient.addColorStop(0.00, "#444");
  gradient.addColorStop(0.75, "#723");
  gradient.addColorStop(1.00, "#a12");
  ColorScheme[2][1][2] = gradient;
}
